1) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:10    [M] IncrementInteger
--- Original
+++ New
@@ @@
     {
-        $data = [1, 2];
+        $data = [2, 2];
         return array_sum($data);
     }
     public function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);
PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

F

Time: 22 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testMultiLineArray
Failed asserting that 4 is identical to 3.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:12

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

2) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:10    [M] OneZeroInteger
--- Original
+++ New
@@ @@
     {
-        $data = [1, 2];
+        $data = [0, 2];
         return array_sum($data);
     }
     public function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);
PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

F

Time: 22 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testMultiLineArray
Failed asserting that 2 is identical to 3.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:12

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

3) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:14    [M] FunctionCall
--- Original
+++ New
@@ @@
         $data = [1, 2];
-        return array_sum($data);
+        array_sum($data);
+        return null;
     }
     public function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);
PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

F

Time: 23 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testMultiLineArray
Failed asserting that null is identical to 3.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:12

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

4) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:8    [M] PublicVisibility
--- Original
+++ New
@@ @@
 {
-    public function multiLineArray()
+    protected function multiLineArray()
     {
         $data = [1, 2];
         return array_sum($data);
     }
     public function singleLineArray()
     {
PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

E

Time: 21 ms, Memory: 4.00MB

There was 1 error:

1) MyClassTest::testMultiLineArray
Error: Call to protected method App\MyClass::multiLineArray() from context 'MyClassTest'

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:12

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

5) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:18    [M] DecrementInteger
--- Original
+++ New
@@ @@
     {
-        $data = [3, 4];
+        $data = [2, 4];
         return array_sum($data);
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.F                                                                  2 / 2 (100%)

Time: 22 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testSingleLineArray
Failed asserting that 6 is identical to 7.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

6) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:18    [M] IncrementInteger
--- Original
+++ New
@@ @@
     {
-        $data = [3, 4];
+        $data = [4, 4];
         return array_sum($data);
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.F                                                                  2 / 2 (100%)

Time: 21 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testSingleLineArray
Failed asserting that 8 is identical to 7.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

7) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:18    [M] DecrementInteger
--- Original
+++ New
@@ @@
     {
-        $data = [3, 4];
+        $data = [3, 3];
         return array_sum($data);
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.F                                                                  2 / 2 (100%)

Time: 22 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testSingleLineArray
Failed asserting that 6 is identical to 7.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

8) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:18    [M] IncrementInteger
--- Original
+++ New
@@ @@
     {
-        $data = [3, 4];
+        $data = [3, 5];
         return array_sum($data);
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.F                                                                  2 / 2 (100%)

Time: 23 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testSingleLineArray
Failed asserting that 8 is identical to 7.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

9) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:20    [M] FunctionCall
--- Original
+++ New
@@ @@
         $data = [3, 4];
-        return array_sum($data);
+        array_sum($data);
+        return null;
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.F                                                                  2 / 2 (100%)

Time: 22 ms, Memory: 4.00MB

There was 1 failure:

1) MyClassTest::testSingleLineArray
Failed asserting that null is identical to 7.

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

10) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:17    [M] PublicVisibility
--- Original
+++ New
@@ @@
     }
-    public function singleLineArray()
+    protected function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);
     }
 }

PHPUnit 7.0.2 by Sebastian Bergmann and contributors.

.E                                                                  2 / 2 (100%)

Time: 22 ms, Memory: 4.00MB

There was 1 error:

1) MyClassTest::testSingleLineArray
Error: Call to protected method App\MyClass::singleLineArray() from context 'MyClassTest'

/Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/tests/MyClassTest.php:18

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

1) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:11    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
-        $data = [1, 2];
+        $data = [1, 1];
         return array_sum($data);
     }
     public function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);

2) /Users/martijngastkemper/Repositories/xdebug-infection-coverage-bug/src/MyClass.php:11    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
-        $data = [1, 2];
+        $data = [1, 3];
         return array_sum($data);
     }
     public function singleLineArray()
     {
         $data = [3, 4];
         return array_sum($data);
